<!-- stack:example-api:prod -->
### Plan: `example-api` / `prod`

<details><summary>Show plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.service.google_cloud_run_v2_service.service will be created
  + resource "google_cloud_run_v2_service" "service" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "owner"                      = "baphomettech"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_INTERNAL_ONLY"
      + labels                  = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "owner"       = "baphomettech"
        }
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "prod-example-api"
      + observed_generation     = (known after apply)
      + project                 = "freestar-491214"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "owner"                      = "baphomettech"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "prodexampleapi@freestar-491214.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + args       = [
                  + "printf '%s' \"${APP_SECRET:-MISSING_SECRET}\" > index.html && python -m http.server 8080",
                ]
              + build_info = (known after apply)
              + command    = [
                  + "sh",
                  + "-c",
                ]
              + image      = "python:3.12-slim"

              + env {
                  + name  = "APP_SECRET"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "prod-example-api-app-secret"
                          + version = "latest"
                        }
                    }
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                }

              + startup_probe (known after apply)
            }

          + scaling {
              + max_instance_count = 5
              + min_instance_count = 0
            }
        }

      + traffic (known after apply)
    }

  # module.service.google_secret_manager_secret_iam_member.secret_access["prod-example-api-app-secret"] will be created
  + resource "google_secret_manager_secret_iam_member" "secret_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:prodexampleapi@freestar-491214.iam.gserviceaccount.com"
      + project   = "freestar-491214"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "prod-example-api-app-secret"
    }

  # module.service.google_service_account.runtime[0] will be created
  + resource "google_service_account" "runtime" {
      + account_id   = "prodexampleapi"
      + disabled     = false
      + display_name = "prod-example-api runtime"
      + email        = "prodexampleapi@freestar-491214.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:prodexampleapi@freestar-491214.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "freestar-491214"
      + unique_id    = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ runtime_service_account_email = "exampleapi@freestar-491214.iam.gserviceaccount.com" -> "prodexampleapi@freestar-491214.iam.gserviceaccount.com"
  ~ service_name                  = "example-api" -> "prod-example-api"
  + service_uri                   = (known after apply)

```
</details>

*Approve the **prod** environment to trigger apply.*